nvme/xarray-v5/xarray1.fio.log
test1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test2: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test3: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test4: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test5: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test6: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test7: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test8: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test9: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test10: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test11: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test12: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test13: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test14: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test15: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test16: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test17: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test18: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test19: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test20: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test21: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test22: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test23: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test24: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test25: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test26: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test27: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test28: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test29: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test30: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test31: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
test32: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=2
fio-3.8-5-g464b
Starting 32 processes

test1: (groupid=0, jobs=32): err= 0: pid=2605: Thu Aug  6 01:27:13 2020
   read: IOPS=1841k, BW=7190MiB/s (7539MB/s)(421GiB/60001msec)
    slat (usec): min=3, max=16052, avg= 5.23, stdev= 3.30
    clat (usec): min=8, max=16198, avg=28.77, stdev=11.14
     lat (usec): min=21, max=16207, avg=34.08, stdev=11.72
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   27], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   28], 50.00th=[   28], 60.00th=[   29],
     | 70.00th=[   29], 80.00th=[   30], 90.00th=[   31], 95.00th=[   39],
     | 99.00th=[   43], 99.50th=[   45], 99.90th=[   58], 99.95th=[   74],
     | 99.99th=[  153]
   bw (  KiB/s): min=117824, max=261168, per=3.12%, avg=229946.66, stdev=13168.59, samples=3808
   iops        : min=29456, max=65292, avg=57486.63, stdev=3292.15, samples=3808
  lat (usec)   : 10=0.01%, 20=0.01%, 50=99.74%, 100=0.25%, 250=0.02%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=7.92%, sys=37.60%, ctx=55217635, majf=0, minf=449
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=110434890,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=7190MiB/s (7539MB/s), 7190MiB/s-7190MiB/s (7539MB/s-7539MB/s), io=421GiB (452GB), run=60001-60001msec

Disk stats (read/write):
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n3: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n4: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n5: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n6: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n7: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n8: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n9: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n10: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n11: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n12: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n13: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n14: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n15: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n16: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n113: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n114: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n115: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n116: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n117: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n118: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n119: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n120: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n121: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n122: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n123: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n124: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n125: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n126: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n127: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n128: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%